Revit 2026 API

# SteelElementProperties Class

---

This class is used to attach steel fabrication information to various Revit elements.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.SteelSteelElementProperties

**Namespace:** Autodesk.Revit.DB.Steel**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SteelElementProperties : APIObject
```
```vb
Public Class SteelElementProperties
	Inherits APIObject
```
```cpp
public ref class SteelElementProperties : public APIObject
```
```fsharp
type SteelElementProperties =
    class
        inherit APIObject
    end
```

The SteelElementProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | UniqueID | This method will return the fabrication id. This represents the link between the Revit and the Steel Core element. |

|  | Name | Description |
| --- | --- | --- |
|  | AddFabricationInformationForRevitElements |  |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetReference | This method will return the reference for the given fabrication id. |
|  | GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Revit elements which can have fabrication information are:

  * FamilyInstance (structural beams and columns).
  * StructuralConnectionHandler elements associated to the connection.
  * Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
    * OST_StructConnectionWelds
    * OST_StructConnectionHoles
    * OST_StructConnectionModifiers
    * OST_StructConnectionShearStuds
    * OST_StructConnectionBolts
    * OST_StructConnectionAnchors
    * OST_StructConnectionPlates
  * Some concrete elements (walls, floors, concrete beams, ...) when they are input elements to detailed steel connections.

The class also holds the link to the Steel Core elements.

#### Reference

Autodesk.Revit.DB.Steel Namespace